package manager;

public class InputFile {
    /*
    Должно быть:
    При запуске приложения коллекция должна автоматически заполняться значениями из файла.
    Имя файла должно передаваться программе с помощью: аргумент командной строки.
    Данные должны храниться в файле в формате csv
    Чтение данных из файла необходимо реализовать с помощью класса java.io.InputStreamReader
    Запись данных в файл необходимо реализовать с помощью класса java.io.OutputStreamWriter
    Все классы в программе должны быть задокументированы в формате javadoc.
    Программа должна корректно работать с неправильными данными (ошибки пользовательского ввода, отсутсвие прав доступа к файлу и т.п.).
    
    */
}
